01Hub/fbedit/STM32F4Discovery/STM32F4_LCMeter/main.c
/**
  ******************************************************************************
  * @file    LCMeter/main.c 
  * @author  MCD Application Team / KO
  * @version V1.0.0
  * @date    20-February-2014
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */ 

/**
  ******************************************************************************
  Port pins
  PA.00         Frequency counter input (TIM5)
  PA.01         Frequency counter input (TIM2)
  PA.04         Scope V-Pos DAC1 Output
  PB.07         High Speed Clock
  PB.13         SPI SCK
  PB.15         SPI MOSI
  PC.01         Scope ADC
  PD.00         Frequency counter select0
  PD.01         Frequency counter select1
  PD.02         Frequency counter select2
  PD.06         LCMeter L/C selection, C = Low L = High
  PD.07         LCMeter calibration
  PD.08         USART3 TX
  PD.09         USART3 RX
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  uint32_t HSCSet;
  uint32_t HSCDiv;
} STM32_HSCTypeDef;

typedef struct
{
  uint32_t Frequency;
  uint32_t FrequencySCP;
} STM32_FRQTypeDef;

typedef struct
{
  uint32_t FrequencyCal0;
  uint32_t FrequencyCal1;
} STM32_LCMTypeDef;

typedef struct
{
  uint32_t ADC_Prescaler;
  uint32_t ADC_TwoSamplingDelay;
  uint32_t ScopeTrigger;
  uint32_t ScopeTriggerLevel;
  uint32_t ScopeTimeDiv;
  uint32_t ScopeVoltDiv;
  uint32_t ScopeVPos;
  uint32_t ADC_TripleMode;
  uint32_t ADC_SampleTime;
  uint32_t ADC_SampleSize;
  uint32_t SubSampling;
} STM32_SCPTypeDef;

typedef struct
{
  uint16_t DDS_Cmd;
  uint16_t DDS_Wave;
  uint32_t DDS__PhaseAdd;
  uint32_t DDS_Amplitude;
  uint32_t DDS_DCOffset;
} STM32_DDSTypeDef;

typedef struct
{
  uint8_t DataBlocks;
  uint8_t TriggerValue;
  uint8_t TriggerMask;
  uint8_t TriggerWait;
  uint16_t LGASampleRateDiv;
  uint16_t LGASampleRate;
} STM32_LGATypeDef;


typedef struct
{
  uint32_t Cmd;
  STM32_HSCTypeDef STM32_HSC;
  STM32_FRQTypeDef STM32_FRQ;
  STM32_LCMTypeDef STM32_LCM;
  STM32_SCPTypeDef STM32_SCP;
  STM32_DDSTypeDef STM32_DDS;
  STM32_LGATypeDef STM32_LGA;
  uint32_t TickCount;
  uint32_t PreviousCountTIM2;
  uint32_t ThisCountTIM2;
  uint32_t PreviousCountTIM5;
  uint32_t ThisCountTIM5;
  char BTBuff[64];
} STM32_CMDTypeDef;

/* Private define ------------------------------------------------------------*/
/* DDS WaveType */
#define CMD_DONE                                ((uint8_t)0)
#define CMD_LCMCAL                              ((uint8_t)1)
#define CMD_LCMCAP                              ((uint8_t)2)
#define CMD_LCMIND                              ((uint8_t)3)
#define CMD_FRQCH1                              ((uint8_t)4)
#define CMD_FRQCH2                              ((uint8_t)5)
#define CMD_FRQCH3                              ((uint8_t)6)
#define CMD_SCPSET                              ((uint8_t)7)
#define CMD_HSCSET                              ((uint8_t)8)
#define CMD_DDSSET                              ((uint8_t)9)
#define CMD_LGASET                              ((uint8_t)10)

#define DDS_PHASESET                            ((uint8_t)1)
#define DDS_WAVESET                             ((uint8_t)2)

#define ADC_CDR_ADDRESS                         ((uint32_t)0x40012308)
#define PE_IDR_Address                          ((uint32_t)0x40021011)
#define SCOPE_DATAPTR                           ((uint32_t)0x20008000)
#define LGA_DATAPTR                             ((uint32_t)0x20008000)
#define SCOPE_DATASIZE                          ((uint32_t)0x10000)
#define STM32_CLOCK                             ((uint32_t)200000000)
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO STM32_CMDTypeDef STM32_CMD;                // 0x20000014

/* Private function prototypes -----------------------------------------------*/
void RCC_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void DAC_Config(void);
void DMA_SingleConfig(void);
void ADC_SingleConfig(void);
void DMA_TripleConfig(void);
void ADC_TripleConfig(void);
void SPI_Config(void);
void USART_Config(uint32_t Baud);
void ScopeSubSampling(void);
uint32_t GetFrequency(void);
void LCM_Calibrate(void);
void SPISendData(uint16_t tx);
void USART3_putdata(uint8_t *dat,uint16_t len);
void USART3_puts(char *str);
void USART3_getdata(uint8_t *dat,uint16_t len);
void DMA_LGAConfig(void);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f4xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f4xx.c file
  */
  __IO uint32_t i;

  /* RCC Configuration */
  RCC_Config();
  /* GPIO Configuration */
  GPIO_Config();
  /* TIM Configuration */
  TIM_Config();
  /* NVIC Configuration */
  NVIC_Config();
  /* DAC Configuration */
  DAC_Config();
  /* SPI Configuration */
  SPI_Config();
  /* USART Configuration */
  USART_Config(115200);
  /* Calibrate LC Meter */
  LCM_Calibrate();

  // /* Update baudrate */
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // USART3_puts("AT\0");
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount)
  // {
    // if ((USART3->SR & USART_FLAG_RXNE) != 0)
    // {
      // STM32_CMD.BTBuff[i] = USART3->DR;
      // i++;
    // }
  // }
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount);
  // USART3_puts("AT+BAUD8\0");
  // STM32_CMD.Cmd = STM32_CMD.TickCount;
  // while (STM32_CMD.Cmd == STM32_CMD.TickCount)
  // {
    // if ((USART3->SR & USART_FLAG_RXNE) != 0)
    // {
      // STM32_CMD.BTBuff[i] = USART3->DR;
      // i++;
    // }
  // }
  // while (1)
  // {
  // }

  while (1)
  {
    USART3_getdata((uint8_t *)&STM32_CMD.Cmd,4);
    switch (STM32_CMD.Cmd)
    {
      case CMD_LCMCAL:
        LCM_Calibrate();
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_LCM.FrequencyCal0,sizeof(STM32_LCMTypeDef));
        break;
      case CMD_LCMCAP:
        GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_LCM.FrequencyCal0,sizeof(STM32_LCMTypeDef));
        break;
      case CMD_LCMIND:
        GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_6);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_LCM.FrequencyCal0,sizeof(STM32_LCMTypeDef));
        break;
      case CMD_FRQCH1:
        GPIO_ResetBits(GPIOD, GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_0);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_FRQCH2:
        GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_1);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_FRQCH3:
        GPIO_ResetBits(GPIOD, GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1);
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_SCPSET:
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_SCP.ADC_Prescaler,sizeof(STM32_SCPTypeDef));
        /* Set V-Pos */
        DAC_SetChannel1Data(DAC_Align_12b_R, STM32_CMD.STM32_SCP.ScopeVPos);
        if (STM32_CMD.STM32_SCP.ADC_TripleMode)
        {
          /* DMA Configuration */
          DMA_TripleConfig();
          /* ADC Configuration */
          ADC_TripleConfig();
        }
        else
        {
          /* DMA Configuration */
          DMA_SingleConfig();
          /* ADC Configuration */
          ADC_SingleConfig();
        }
        /* Start ADC1 Software Conversion */
        ADC1->CR2 |= (uint32_t)ADC_CR2_SWSTART;
        while (DMA_GetFlagStatus(DMA2_Stream0,DMA_FLAG_HTIF0)==RESET);
        /* Half done */
        USART3_putdata((uint8_t *)SCOPE_DATAPTR, STM32_CMD.STM32_SCP.ADC_SampleSize / 2);
        while (DMA_GetFlagStatus(DMA2_Stream0,DMA_FLAG_TCIF0)==RESET);
        /* Done */
        ADC->CCR=0;
        ADC1->CR2=0;
        ADC2->CR2=0;
        ADC3->CR2=0;
        USART3_putdata((uint8_t *)(SCOPE_DATAPTR + STM32_CMD.STM32_SCP.ADC_SampleSize / 2), STM32_CMD.STM32_SCP.ADC_SampleSize - STM32_CMD.STM32_SCP.ADC_SampleSize / 2);
        break;
      case CMD_HSCSET:
        GPIO_ResetBits(GPIOD, GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
        GPIO_SetBits(GPIOD, GPIO_Pin_0);
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_HSC.HSCSet,sizeof(STM32_HSCTypeDef));
        TIM4->ARR = STM32_CMD.STM32_HSC.HSCSet;
        TIM4->CCR2 = (STM32_CMD.STM32_HSC.HSCSet+1) / 2;
        TIM4->PSC = STM32_CMD.STM32_HSC.HSCDiv;
        USART3_putdata((uint8_t *)&STM32_CMD.STM32_FRQ.Frequency,sizeof(STM32_FRQTypeDef));
        break;
      case CMD_DDSSET:
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_DDS.DDS_Cmd,sizeof(STM32_DDSTypeDef));
        if (STM32_CMD.STM32_DDS.DDS_Cmd == DDS_PHASESET)
        {
          SPISendData(DDS_PHASESET);
          SPISendData(STM32_CMD.STM32_DDS.DDS__PhaseAdd & 0xFFFF);
          SPISendData(STM32_CMD.STM32_DDS.DDS__PhaseAdd >> 16);
        }
        else if (STM32_CMD.STM32_DDS.DDS_Cmd == DDS_WAVESET)
        {
          SPISendData(DDS_WAVESET);
          SPISendData(STM32_CMD.STM32_DDS.DDS_Wave & 0xFFFF);
          SPISendData(STM32_CMD.STM32_DDS.DDS_Amplitude & 0xFFFF);
          SPISendData(STM32_CMD.STM32_DDS.DDS_DCOffset & 0xFFFF);
        }
        break;
      case CMD_LGASET:
        USART3_getdata((uint8_t *)&STM32_CMD.STM32_LGA.DataBlocks,sizeof(STM32_LGATypeDef));
        /* Set the Prescaler value */
        TIM8->PSC = STM32_CMD.STM32_LGA.LGASampleRateDiv;
        /* Set the Autoreload value */
        TIM8->ARR = STM32_CMD.STM32_LGA.LGASampleRate;
        TIM8->CNT =  STM32_CMD.STM32_LGA.LGASampleRate-1;
        DMA_LGAConfig();
        TIM_DMACmd(TIM8, TIM_DMA_Update, ENABLE);
        /* DMA2_Stream1 enable */
        DMA_Cmd(DMA2_Stream1, ENABLE);
        /* Enable timer */
        TIM8->CR1 |= TIM_CR1_CEN;
        while (DMA_GetFlagStatus(DMA2_Stream1,DMA_FLAG_HTIF1) == RESET);
        /* Half done */
        USART3_putdata((uint8_t *)LGA_DATAPTR, STM32_CMD.STM32_LGA.DataBlocks * 1024 / 2);
        while (DMA_GetFlagStatus(DMA2_Stream1,DMA_FLAG_TCIF1) == RESET);
        /* Done */
        USART3_putdata((uint8_t *)(LGA_DATAPTR + STM32_CMD.STM32_LGA.DataBlocks * 1024 / 2), STM32_CMD.STM32_LGA.DataBlocks * 1024 / 2);
        TIM_Cmd(TIM8, DISABLE);
        DMA_DeInit(DMA2_Stream1);
        break;
    }
  }
}

/**
  * @brief  Get frequency reading.
  * @param  None
  * @retval None
  */
uint32_t GetFrequency(void)
{
  uint32_t i;
  i = STM32_CMD.TickCount;
  while (i == STM32_CMD.TickCount);
  return STM32_CMD.STM32_FRQ.Frequency;
}

/**
  * @brief  Calibrate LC Meter.
  * @param  None
  * @retval None
  */
void LCM_Calibrate(void)
{
  uint32_t i;
  GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
  STM32_CMD.STM32_LCM.FrequencyCal0 = 0;
  STM32_CMD.STM32_LCM.FrequencyCal1 = 0;
  i = GetFrequency();
  i = 0;
  while (i < 4)
  {
    STM32_CMD.STM32_LCM.FrequencyCal0 += GetFrequency();
    i++;
  }
  STM32_CMD.STM32_LCM.FrequencyCal0 /= 4;
  GPIO_SetBits(GPIOD, GPIO_Pin_7);
  i = GetFrequency();
  i = 0;
  while (i < 4)
  {
    STM32_CMD.STM32_LCM.FrequencyCal1 += GetFrequency();
    i++;
  }
  STM32_CMD.STM32_LCM.FrequencyCal1 /= 4;
  GPIO_ResetBits(GPIOD, GPIO_Pin_7);
}

void SPISendData(uint16_t tx)
{
	SPI2->DR = tx;                            // write data to be transmitted to the SPI data register
	while (!(SPI2->SR & SPI_I2S_FLAG_TXE));   // wait until transmit complete
  while (SPI1->SR & SPI_I2S_FLAG_BSY);      // wait until SPI is not busy anymore
}

