01Hub/fbedit/STM32F4Discovery/STM32F4_LCMeter/main.c
/*******************************************************************************
* Function Name  : USART_Configuration
* Description    : Configures USART3 to to comunicate with Bluetooth module
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART_Config(uint32_t Baud)
{
  USART_InitTypeDef USART_InitStructure;
 
  USART_StructInit(&USART_InitStructure);
  //USART_DeInit(USART3);
  USART_InitStructure.USART_BaudRate = Baud;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No ;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART3, &USART_InitStructure);
  /* Connect USART3 pins */  
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_USART3);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_USART3);
  /* Enable the USART3 */
  USART_Cmd(USART3, ENABLE);
}

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  STM32_CMD.ThisCountTIM2 = TIM2->CNT;
  STM32_CMD.ThisCountTIM5 = TIM5->CNT;
  STM32_CMD.STM32_FRQ.Frequency = STM32_CMD.ThisCountTIM2 - STM32_CMD.PreviousCountTIM2;
  STM32_CMD.PreviousCountTIM2 = STM32_CMD.ThisCountTIM2;
  STM32_CMD.STM32_FRQ.FrequencySCP = STM32_CMD.ThisCountTIM5 - STM32_CMD.PreviousCountTIM5;
  STM32_CMD.PreviousCountTIM5 = STM32_CMD.ThisCountTIM5;
  STM32_CMD.TickCount++;
  TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
  STM_EVAL_LEDToggle(LED3);
}

/*****END OF FILE****/
